Revit 2026 API

# ConnectorElementSetLinkedConnectorElement Method

---

Set the linked connector element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLinkedConnectorElement(
	ConnectorElement otherConnector
)
```
```vb
Public Sub SetLinkedConnectorElement (
	otherConnector As ConnectorElement
)
```
```cpp
public:
void SetLinkedConnectorElement(
	ConnectorElement^ otherConnector
)
```
```fsharp
member SetLinkedConnectorElement :
        otherConnector : ConnectorElement -> unit
```

#### Parameters

otherConnector ConnectorElement
     The connector to link to.

| Exception | Condition |
| --- | --- |
| ArgumentException | The connector being linked to is a different domain than that of the calling connector. -or- The connector being linked to is the same as the calling connector. |
| InvalidOperationException | This connector type does not support linked connectors. |

Set the linked connector to  to remove the link.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace